In [1]:
import pandas as pd
import numpy as np

In [11]:
students_performance = pd.read_csv("./StudentsPerformance.csv", sep = ",")

In [13]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## .iloc

### integer location [rows, columns]

In [38]:
students_performance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [37]:
students_performance.iloc[[0,3 ,-1], 0:3]

     gender race/ethnicity parental level of education
0    female        group B           bachelor's degree
3      male        group A          associate's degree
999  female        group D                some college

## Changing indexes

In [40]:
students_performance_with_names = students_performance.iloc[[0, 3, 4, 7, 8]]
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [41]:
students_performance_with_names.index = ["Alex", "Dave", "Greg", "John", "George"]

In [42]:
students_performance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Alex,female,group B,bachelor's degree,standard,none,72,72,74
Dave,male,group A,associate's degree,free/reduced,none,47,57,44
Greg,male,group C,some college,standard,none,76,78,75
John,male,group B,some college,free/reduced,none,40,43,39
George,male,group D,high school,free/reduced,completed,64,64,67

## .loc [[rows' names], [columns' names]]

In [48]:
students_performance_with_names.loc[["Alex", "John"], ["gender", "writing score"]]

      gender  writing score
Alex  female             74
John    male             39

## pd.Series output instead of pd.DataFrame after selecting only one column

In [55]:
students_performance_with_names.iloc[:, 0]

Alex      female
Dave        male
Greg        male
John        male
George      male
Name: gender, dtype: object

In [54]:
type(students_performance_with_names.iloc[:, 0])

pandas.core.series.Series

In [57]:
my_series_1 = pd.Series([1, 2, 3], index = ["Alex", "Dave", "Greg"])
my_series_2 = pd.Series([4, 5, 6], index = ["Alex", "Dave", "Greg"])

In [58]:
pd.DataFrame({"col_name-1": my_series_1, "col_name-2": my_series_2})

      col_name-1  col_name-2
Alex           1           4
Dave           2           5
Greg           3           6

## series output  []

In [60]:
students_performance_with_names["gender"]

Alex      female
Dave        male
Greg        male
John        male
George      male
Name: gender, dtype: object

## dataframe output [[]]

In [61]:
students_performance_with_names[["gender"]]

        gender
Alex    female
Dave      male
Greg      male
John      male
George    male

# _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _

In [2]:
titanic = pd.read_csv("./titanic.csv")

In [9]:
titanic.get_dtypes_counts()

AttributeError: 'DataFrame' object has no attribute 'get_dtypes_counts'